package ca;

public class Test {
    public static void main() {
        for (int i = 0; i<65536; i++) {
            Field test = new Field(new Rule(110), i);
            int res = test.eval();
            System.out.println(res);
            if (i==65535)
                break;
        }
    }
/*
Проверка
------------------------
Начальное состояние:
00000000000000000000000000000001
------------------------
Окрестность->состояние (правило 110):
111 0
110 1
101 1
100 0
011 1
010 1
001 1
000 0
------------------------
Первое поколение:
00000000000000000000000000000011
+++++++++++++++++++
Или:
1->3
*/
}
